GrumpyOldPizza/ArduinoCore-stm32wb/boards.txt
Mothra-WB5MMG.upload.tool=dfu-util
Mothra-WB5MMG.upload.tool.default=dfu-util
Mothra-WB5MMG.upload.protocol=dfu
Mothra-WB5MMG.upload.address=0x08000000
Mothra-WB5MMG.upload.interface=0
Mothra-WB5MMG.upload.vid=0x1209
Mothra-WB5MMG.upload.pid=0x6673
Mothra-WB5MMG.upload.use_1200bps_touch=false
Mothra-WB5MMG.upload.wait_for_upload_port=false
Mothra-WB5MMG.upload.native_usb=true
Mothra-WB5MMG.upload.maximum_size=393216
Mothra-WB5MMG.upload.maximum_data_size=196608

Mothra-WB5MMG.menu.usb.cdc=Serial
Mothra-WB5MMG.menu.usb.cdc.build.usb_type=1
Mothra-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
Mothra-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
Mothra-WB5MMG.menu.usb.none=No USB
Mothra-WB5MMG.menu.usb.none.build.usb_type=0

Mothra-WB5MMG.menu.speed.64=64 MHz
Mothra-WB5MMG.menu.speed.64.build.f_cpu=64000000L
Mothra-WB5MMG.menu.speed.32=32 MHz
Mothra-WB5MMG.menu.speed.32.build.f_cpu=32000000L
Mothra-WB5MMG.menu.speed.16=16 MHz (No USB)
Mothra-WB5MMG.menu.speed.16.build.f_cpu=16000000L
Mothra-WB5MMG.menu.speed.2=2 MHz (No USB)
Mothra-WB5MMG.menu.speed.2.build.f_cpu=2000000L

Mothra-WB5MMG.menu.security.none=None
Mothra-WB5MMG.menu.security.sien=Signature + Encryption
Mothra-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
Mothra-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
Mothra-WB5MMG.menu.security.sien.build.keys.sign_key=ecc256_key.pem
Mothra-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin

# ---------------------------------------
# P&G Snoopy6
# ---------------------------------------
Snoopy6-WB5MMG.name=Snoopy6-WB5MMG
Snoopy6-WB5MMG.vid.0=0x1209
Snoopy6-WB5MMG.pid.0=0x6674

Snoopy6-WB5MMG.build.f_cpu=64000000L
Snoopy6-WB5MMG.build.board=STM32WB_SNOOPY6
Snoopy6-WB5MMG.build.arch=stm32wb
Snoopy6-WB5MMG.build.core=arduino
Snoopy6-WB5MMG.build.mcu=cortex-m4
Snoopy6-WB5MMG.build.architecture=armv7e-m
Snoopy6-WB5MMG.build.fpu=fpv4-sp-d16
Snoopy6-WB5MMG.build.float-abi=hard
Snoopy6-WB5MMG.build.uuid=55b15986-3270-472b-bcc4-a61878f0ad6e
Snoopy6-WB5MMG.build.usb_vid=0x1209
Snoopy6-WB5MMG.build.usb_pid=0x6674
Snoopy6-WB5MMG.build.usb_manufacturer="P&G"
Snoopy6-WB5MMG.build.usb_product="Snoopy6-WB5MMG"
Snoopy6-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
Snoopy6-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
Snoopy6-WB5MMG.build.openocdscript=openocd_scripts/snoopy6-wb5mmg.cfg
Snoopy6-WB5MMG.build.variant=Snoopy6-WB5MMG
Snoopy6-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
Snoopy6-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

Snoopy6-WB5MMG.upload.tool=dfu-util
Snoopy6-WB5MMG.upload.tool.default=dfu-util
Snoopy6-WB5MMG.upload.protocol=dfu
Snoopy6-WB5MMG.upload.address=0x08000000
Snoopy6-WB5MMG.upload.interface=0
Snoopy6-WB5MMG.upload.vid=0x1209
Snoopy6-WB5MMG.upload.pid=0x6674
Snoopy6-WB5MMG.upload.use_1200bps_touch=false
Snoopy6-WB5MMG.upload.wait_for_upload_port=false
Snoopy6-WB5MMG.upload.native_usb=true
Snoopy6-WB5MMG.upload.maximum_size=393216
Snoopy6-WB5MMG.upload.maximum_data_size=196608

Snoopy6-WB5MMG.menu.usb.cdc=Serial
Snoopy6-WB5MMG.menu.usb.cdc.build.usb_type=1
Snoopy6-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
Snoopy6-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
Snoopy6-WB5MMG.menu.usb.none=No USB
Snoopy6-WB5MMG.menu.usb.none.build.usb_type=0

Snoopy6-WB5MMG.menu.speed.64=64 MHz
Snoopy6-WB5MMG.menu.speed.64.build.f_cpu=64000000L
Snoopy6-WB5MMG.menu.speed.32=32 MHz
Snoopy6-WB5MMG.menu.speed.32.build.f_cpu=32000000L
Snoopy6-WB5MMG.menu.speed.16=16 MHz (No USB)
Snoopy6-WB5MMG.menu.speed.16.build.f_cpu=16000000L
Snoopy6-WB5MMG.menu.speed.2=2 MHz (No USB)
Snoopy6-WB5MMG.menu.speed.2.build.f_cpu=2000000L

Snoopy6-WB5MMG.menu.security.none=None
Snoopy6-WB5MMG.menu.security.sien=Signature + Encryption
Snoopy6-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
Snoopy6-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
Snoopy6-WB5MMG.menu.security.sien.build.keys.sign_key=ecc256_key.pem
Snoopy6-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin


# ---------------------------------------
# P&G Raptor
# ---------------------------------------
Raptor-WB5MMG.name=Raptor-WB5MMG
Raptor-WB5MMG.vid.0=0x1209
Raptor-WB5MMG.pid.0=0x6677

Raptor-WB5MMG.build.f_cpu=64000000L
Raptor-WB5MMG.build.board=STM32WB_RAPTOR
Raptor-WB5MMG.build.arch=stm32wb
Raptor-WB5MMG.build.core=arduino
Raptor-WB5MMG.build.mcu=cortex-m4
Raptor-WB5MMG.build.architecture=armv7e-m
Raptor-WB5MMG.build.fpu=fpv4-sp-d16
Raptor-WB5MMG.build.float-abi=hard
Raptor-WB5MMG.build.uuid=07fcdd24-aa7d-4bd5-93b1-9923e90c457c
Raptor-WB5MMG.build.usb_vid=0x1209
Raptor-WB5MMG.build.usb_pid=0x6677
Raptor-WB5MMG.build.usb_manufacturer="R&G"
Raptor-WB5MMG.build.usb_product="Raptor-WB5MMG"
Raptor-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
Raptor-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
Raptor-WB5MMG.build.openocdscript=openocd_scripts/raptor-wb5mmg.cfg
Raptor-WB5MMG.build.variant=Raptor-WB5MMG
Raptor-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
Raptor-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

Raptor-WB5MMG.upload.tool=dfu-util
Raptor-WB5MMG.upload.tool.default=dfu-util
Raptor-WB5MMG.upload.protocol=dfu
Raptor-WB5MMG.upload.address=0x08000000
Raptor-WB5MMG.upload.interface=0
Raptor-WB5MMG.upload.vid=0x1209
Raptor-WB5MMG.upload.pid=0x6677
Raptor-WB5MMG.upload.use_1200bps_touch=false
Raptor-WB5MMG.upload.wait_for_upload_port=false
Raptor-WB5MMG.upload.native_usb=true
Raptor-WB5MMG.upload.maximum_size=393216
Raptor-WB5MMG.upload.maximum_data_size=196608

Raptor-WB5MMG.menu.usb.cdc=Serial
Raptor-WB5MMG.menu.usb.cdc.build.usb_type=1
Raptor-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
Raptor-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
Raptor-WB5MMG.menu.usb.none=No USB
Raptor-WB5MMG.menu.usb.none.build.usb_type=0

Raptor-WB5MMG.menu.speed.64=64 MHz
Raptor-WB5MMG.menu.speed.64.build.f_cpu=64000000L
Raptor-WB5MMG.menu.speed.32=32 MHz
Raptor-WB5MMG.menu.speed.32.build.f_cpu=32000000L
Raptor-WB5MMG.menu.speed.16=16 MHz (No USB)
Raptor-WB5MMG.menu.speed.16.build.f_cpu=16000000L
Raptor-WB5MMG.menu.speed.2=2 MHz (No USB)
Raptor-WB5MMG.menu.speed.2.build.f_cpu=2000000L

Raptor-WB5MMG.menu.security.none=None
Raptor-WB5MMG.menu.security.sien=Signature + Encryption
Raptor-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
Raptor-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
Raptor-WB5MMG.menu.security.sien.build.keys.sign_key=ecc256_key.pem
Raptor-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin


# ---------------------------------------
# Tlera Sasquatch
# ---------------------------------------
Sasquatch-WB5MMG.name=Sasquatch-WB5MMG
Sasquatch-WB5MMG.vid.0=0x1209
Sasquatch-WB5MMG.pid.0=0x6678

Sasquatch-WB5MMG.build.f_cpu=64000000L
Sasquatch-WB5MMG.build.board=STM32WB_SASQUATCH
Sasquatch-WB5MMG.build.arch=stm32wb
Sasquatch-WB5MMG.build.core=arduino
Sasquatch-WB5MMG.build.mcu=cortex-m4
Sasquatch-WB5MMG.build.architecture=armv7e-m
Sasquatch-WB5MMG.build.fpu=fpv4-sp-d16
Sasquatch-WB5MMG.build.float-abi=hard
Sasquatch-WB5MMG.build.uuid=271009af-4a3f-46e3-979a-68baf7f911ab
Sasquatch-WB5MMG.build.usb_vid=0x1209
Sasquatch-WB5MMG.build.usb_pid=0x6678
Sasquatch-WB5MMG.build.usb_manufacturer="Tlera Corporation"
Sasquatch-WB5MMG.build.usb_product="Sasquatch-WB5MMG"
Sasquatch-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
Sasquatch-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
Sasquatch-WB5MMG.build.openocdscript=openocd_scripts/sasquatch-wb5mmg.cfg
Sasquatch-WB5MMG.build.variant=Sasquatch-WB5MMG
Sasquatch-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
Sasquatch-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

Sasquatch-WB5MMG.upload.tool=dfu-util
Sasquatch-WB5MMG.upload.tool.default=dfu-util
Sasquatch-WB5MMG.upload.protocol=dfu
Sasquatch-WB5MMG.upload.address=0x08000000
Sasquatch-WB5MMG.upload.interface=0
Sasquatch-WB5MMG.upload.vid=0x1209
Sasquatch-WB5MMG.upload.pid=0x6678
Sasquatch-WB5MMG.upload.use_1200bps_touch=false
Sasquatch-WB5MMG.upload.wait_for_upload_port=false
Sasquatch-WB5MMG.upload.native_usb=true
Sasquatch-WB5MMG.upload.maximum_size=393216
Sasquatch-WB5MMG.upload.maximum_data_size=196608

