GrumpyOldPizza/ArduinoCore-stm32wb/boards.txt
Sasquatch-WB5MMG.menu.usb.cdc=Serial
Sasquatch-WB5MMG.menu.usb.cdc.build.usb_type=1
Sasquatch-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
Sasquatch-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
Sasquatch-WB5MMG.menu.usb.none=No USB
Sasquatch-WB5MMG.menu.usb.none.build.usb_type=0

Sasquatch-WB5MMG.menu.speed.64=64 MHz
Sasquatch-WB5MMG.menu.speed.64.build.f_cpu=64000000L
Sasquatch-WB5MMG.menu.speed.32=32 MHz
Sasquatch-WB5MMG.menu.speed.32.build.f_cpu=32000000L
Sasquatch-WB5MMG.menu.speed.16=16 MHz (No USB)
Sasquatch-WB5MMG.menu.speed.16.build.f_cpu=16000000L
Sasquatch-WB5MMG.menu.speed.2=2 MHz (No USB)
Sasquatch-WB5MMG.menu.speed.2.build.f_cpu=2000000L

Sasquatch-WB5MMG.menu.security.none=None
Sasquatch-WB5MMG.menu.security.sien=Signature + Encryption
Sasquatch-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
Sasquatch-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
Sasquatch-WB5MMG.menu.security.sien.build.keys.sign_key=ecc256_key.pem
Sasquatch-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin


# ---------------------------------------
# Sparkfun MicroMod
# ---------------------------------------
MicroMod-WB5MMG.name=MicroMod-WB5MMG
MicroMod-WB5MMG.vid.0=0x1209
MicroMod-WB5MMG.pid.0=0x6675

MicroMod-WB5MMG.build.f_cpu=64000000L
MicroMod-WB5MMG.build.board=STM32WB_MICROMOD
MicroMod-WB5MMG.build.arch=stm32wb
MicroMod-WB5MMG.build.core=arduino
MicroMod-WB5MMG.build.mcu=cortex-m4
MicroMod-WB5MMG.build.architecture=armv7e-m
MicroMod-WB5MMG.build.fpu=fpv4-sp-d16
MicroMod-WB5MMG.build.float-abi=hard
MicroMod-WB5MMG.build.uuid=eafee6d0-b575-4412-aeb4-c30ecb0d3c6e
MicroMod-WB5MMG.build.usb_vid=0x1209
MicroMod-WB5MMG.build.usb_pid=0x6675
MicroMod-WB5MMG.build.usb_manufacturer="Sparkfun"
MicroMod-WB5MMG.build.usb_product="MicroMod-WB5MMG"
MicroMod-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
MicroMod-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
MicroMod-WB5MMG.build.variant=MicroMod-WB5MMG
MicroMod-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
MicroMod-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

MicroMod-WB5MMG.debug.svd_file={runtime.platform.path}/system/CMSIS/Device/ST/SVD/STM32WB55_CM4.svd
MicroMod-WB5MMG.programmer.target=target/stm32wbx.cfg

MicroMod-WB5MMG.upload.tool=dfu-util
MicroMod-WB5MMG.upload.tool.default=dfu-util
MicroMod-WB5MMG.upload.protocol=dfu
MicroMod-WB5MMG.upload.address=0x08000000
MicroMod-WB5MMG.upload.interface=0
MicroMod-WB5MMG.upload.vid=0x1209
MicroMod-WB5MMG.upload.pid=0x6675
MicroMod-WB5MMG.upload.use_1200bps_touch=false
MicroMod-WB5MMG.upload.wait_for_upload_port=false
MicroMod-WB5MMG.upload.native_usb=true
MicroMod-WB5MMG.upload.maximum_size=393216
MicroMod-WB5MMG.upload.maximum_data_size=196608

MicroMod-WB5MMG.menu.usb.cdc=Serial
MicroMod-WB5MMG.menu.usb.cdc.build.usb_type=1
MicroMod-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
MicroMod-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
MicroMod-WB5MMG.menu.usb.none=No USB
MicroMod-WB5MMG.menu.usb.none.build.usb_type=0

MicroMod-WB5MMG.menu.speed.64=64 MHz
MicroMod-WB5MMG.menu.speed.64.build.f_cpu=64000000L
MicroMod-WB5MMG.menu.speed.32=32 MHz
MicroMod-WB5MMG.menu.speed.32.build.f_cpu=32000000L
MicroMod-WB5MMG.menu.speed.16=16 MHz (No USB)
MicroMod-WB5MMG.menu.speed.16.build.f_cpu=16000000L
MicroMod-WB5MMG.menu.speed.2=2 MHz (No USB)
MicroMod-WB5MMG.menu.speed.2.build.f_cpu=2000000L

MicroMod-WB5MMG.menu.security.none=None
MicroMod-WB5MMG.menu.security.sien=Signature + Encryption
MicroMod-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
MicroMod-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
MicroMod-WB5MMG.menu.security.sien.build.keys.sign_key=ecc256_key.pem
MicroMod-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin


# ---------------------------------------
# ST STM32WB5MM-DK
# ---------------------------------------
DISCO-WB5MMG.name=DISCO-WB5MMG
DISCO-WB5MMG.vid.0=0x1209
DISCO-WB5MMG.pid.0=0x6676

DISCO-WB5MMG.build.f_cpu=64000000L
DISCO-WB5MMG.build.board=STM32WB_DISCO
DISCO-WB5MMG.build.arch=stm32wb
DISCO-WB5MMG.build.core=arduino
DISCO-WB5MMG.build.mcu=cortex-m4
DISCO-WB5MMG.build.architecture=armv7e-m
DISCO-WB5MMG.build.fpu=fpv4-sp-d16
DISCO-WB5MMG.build.float-abi=hard
DISCO-WB5MMG.build.uuid=4122cbd9-6a5a-4ea5-b631-6d162ecd6f84
DISCO-WB5MMG.build.usb_vid=0x1209
DISCO-WB5MMG.build.usb_pid=0x6676
DISCO-WB5MMG.build.usb_manufacturer="STMicroelectronics"
DISCO-WB5MMG.build.usb_product="DISCO-WB5MMG"
DISCO-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
DISCO-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
DISCO-WB5MMG.build.openocdscript=openocd_scripts/disco-wb5mmg.cfg
DISCO-WB5MMG.build.variant=DISCO-WB5MMG
DISCO-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
DISCO-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

DISCO-WB5MMG.upload.tool=dfu-util
DISCO-WB5MMG.upload.tool.default=dfu-util
DISCO-WB5MMG.upload.protocol=dfu
DISCO-WB5MMG.upload.address=0x08000000
DISCO-WB5MMG.upload.interface=0
DISCO-WB5MMG.upload.vid=0x1209
DISCO-WB5MMG.upload.pid=0x6676
DISCO-WB5MMG.upload.use_1200bps_touch=false
DISCO-WB5MMG.upload.wait_for_upload_port=false
DISCO-WB5MMG.upload.native_usb=true
DISCO-WB5MMG.upload.maximum_size=393216
DISCO-WB5MMG.upload.maximum_data_size=196608

DISCO-WB5MMG.menu.usb.cdc=Serial
DISCO-WB5MMG.menu.usb.cdc.build.usb_type=1
DISCO-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
DISCO-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
DISCO-WB5MMG.menu.usb.none=No USB
DISCO-WB5MMG.menu.usb.none.build.usb_type=0

DISCO-WB5MMG.menu.speed.64=64 MHz
DISCO-WB5MMG.menu.speed.64.build.f_cpu=64000000L
DISCO-WB5MMG.menu.speed.32=32 MHz
DISCO-WB5MMG.menu.speed.32.build.f_cpu=32000000L
DISCO-WB5MMG.menu.speed.16=16 MHz (No USB)
DISCO-WB5MMG.menu.speed.16.build.f_cpu=16000000L
DISCO-WB5MMG.menu.speed.2=2 MHz (No USB)
DISCO-WB5MMG.menu.speed.2.build.f_cpu=2000000L

DISCO-WB5MMG.menu.security.none=None
DISCO-WB5MMG.menu.security.sien=Signature + Encryption
DISCO-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
DISCO-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
DISCO-WB5MMG.menu.security.sien.build.keys.sign_key=ecc256_key.pem
DISCO-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin

# ---------------------------------------
# ST Nucleo
# ---------------------------------------
NUCLEO-WB55RG.name=NUCLEO-WB55RG
NUCLEO-WB55RG.vid.0=0x0483
NUCLEO-WB55RG.pid.0=0x374b

NUCLEO-WB55RG.build.f_cpu=64000000L
NUCLEO-WB55RG.build.board=STM32WB_NUCLEO
NUCLEO-WB55RG.build.arch=stm32wb
NUCLEO-WB55RG.build.core=arduino
NUCLEO-WB55RG.build.mcu=cortex-m4
NUCLEO-WB55RG.build.architecture=armv7e-m
NUCLEO-WB55RG.build.fpu=fpv4-sp-d16
NUCLEO-WB55RG.build.float-abi=hard
NUCLEO-WB55RG.build.uuid=5f46d023-cfcd-45f8-96a3-b6c6ee078048
NUCLEO-WB55RG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.storage_flags} 
NUCLEO-WB55RG.build.ldscript=STM32WB55xx_FLASH.ld 
NUCLEO-WB55RG.build.openocdscript=openocd_scripts/nucleo-wb55rg.cfg
NUCLEO-WB55RG.build.variant=NUCLEO-WB55RG
NUCLEO-WB55RG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
NUCLEO-WB55RG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

NUCLEO-WB55RG.upload.tool=openocd
NUCLEO-WB55RG.upload.tool.default=openocd
NUCLEO-WB55RG.upload.protocol=stlink
NUCLEO-WB55RG.upload.use_1200bps_touch=false
NUCLEO-WB55RG.upload.wait_for_upload_port=false
NUCLEO-WB55RG.upload.native_usb=false
NUCLEO-WB55RG.upload.maximum_size=393216
NUCLEO-WB55RG.upload.maximum_data_size=196608

NUCLEO-WB55RG.menu.storage.none=None
NUCLEO-WB55RG.menu.storage.none.build.storage_type=0
NUCLEO-WB55RG.menu.storage.sflash=SFLASH
NUCLEO-WB55RG.menu.storage.sflash.build.storage_type=1
NUCLEO-WB55RG.menu.storage.sdspi=SDCARD
NUCLEO-WB55RG.menu.storage.sdspi.build.storage_type=2

NUCLEO-WB55RG.menu.speed.64=64 MHz
NUCLEO-WB55RG.menu.speed.64.build.f_cpu=64000000L
NUCLEO-WB55RG.menu.speed.32=32 MHz
NUCLEO-WB55RG.menu.speed.32.build.f_cpu=32000000L
NUCLEO-WB55RG.menu.speed.16=16 MHz (No USB)
NUCLEO-WB55RG.menu.speed.16.build.f_cpu=16000000L
NUCLEO-WB55RG.menu.speed.2=2 MHz (No USB)
NUCLEO-WB55RG.menu.speed.2.build.f_cpu=2000000L
